Repository: JHdehao/Conch
Catalog: Conch/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: 没有接收成功
en: Couldn't Receive
zh_hant: 沒有接收成功

source: 没有改动
en: No changes
zh_hant: 沒有改動

source: 没有未完成的提醒事项
en: No open reminders
zh_hant: 沒有未完成的提醒事項

source: 没有权限访问这个模型（403）。
en: No access to this model (403).
zh_hant: 沒有權限訪問這個模型（403）。

source: 没有要朗读的文字
en: Nothing to read aloud
zh_hant: 沒有要朗讀的文字

source: 没有这台服务器的指纹记录
en: There's no fingerprint on record for this server
zh_hant: 沒有這台伺服器的指紋記錄

source: 没有这条记忆：%@
en: No such memory: %@
zh_hant: 沒有這條記憶：%@

source: 没有需要修改的项
en: Nothing to change
zh_hant: 沒有需要修改的項

source: 没有需要更新的内容
en: Nothing to update
zh_hant: 沒有需要更新的內容

source: 没能在电脑上启动 %@。
en: Couldn't start %@ on the computer.
zh_hant: 沒能在電腦上啟動 %@。

source: 没能结束进程
en: Couldn’t End the Process
zh_hant: 未能結束程序

source: 注意：这个元素被“%@”挡住了（可能是弹窗或横幅），点击可能没有生效。
en: Note: this element is covered by “%@” (probably a pop-up or banner), so the click may not have worked.
zh_hant: 注意：這個元素被「%@」擋住了（可能是彈出視窗或橫幅），點擊可能沒有生效。

source: 浅色主题=%@
en: light theme=%@
zh_hant: 淺色主題=%@

source: 浅色模式
en: Light Mode
zh_hant: 淺色模式

source: 浏览
en: Browse
zh_hant: 瀏覽

source: 浏览器
en: Browser
zh_hant: 瀏覽器

source: 浏览器标签页：
en: Browser tabs:
zh_hant: 瀏覽器標籤頁：

source: 浏览器标签页：（没有）
en: Browser tabs: (none)
zh_hant: 瀏覽器標籤頁：（沒有）

source: 浏览服务器上的文件并存进这个文件夹，走内置 Tailscale，不依赖系统 VPN。
en: Browse a server's files and save them into this folder, through the built-in Tailscale rather than the system VPN.
zh_hant: 瀏覽伺服器上的檔案並存進這個資料夾，走內建 Tailscale，不依賴系統 VPN。

source: 消息没有送到 %@，它可能已经结束了这一轮。
en: The message didn't reach %@; it may have already finished this turn.
zh_hant: 訊息沒有送到 %@，它可能已經結束了這一輪。

source: 深海
en: Deep Sea

source: 深色主题=%@
en: dark theme=%@
zh_hant: 深色主題=%@

source: 深色模式
en: Dark Mode

source: 添加一台服务器，开始你的第一个会话。
en: Add a server to start your first session.
zh_hant: 添加一台伺服器，開始你的第一個會話。

source: 添加一条
en: Add One
zh_hant: 添加一條

source: 添加为服务器
en: Add as Server
zh_hant: 新增為伺服器

source: 添加密钥
en: Add Key
zh_hant: 添加金鑰

source: 添加提醒事项“%@”？
en: Add the reminder “%@”?
zh_hant: 添加提醒事項“%@”？

source: 添加日程“%@”？
en: Add the event “%@”?
zh_hant: 添加行事曆事件“%@”？

source: 添加服务器 %@
en: Add server %@
zh_hant: 添加伺服器 %@

source: 添加照片或文件
en: Add Photos or Files
zh_hant: 加入照片或檔案

source: 添加电脑
en: Add a Computer
zh_hant: 添加電腦

source: 添加记忆
en: Add Memory
zh_hant: 添加記憶

source: 清空
en: Clear

source: 清空了 %@（它所在的单元格或文本框至少要留一段）
en: Cleared %@ (its cell or text box needs at least one paragraph)
zh_hant: 清空了 %@（它所在的儲存格或文字框至少要留一段）

source: 清空全部记忆
en: Clear All Memories
zh_hant: 清空全部記憶

source: 清空助手的全部记忆？
en: Clear all of the assistant's memories?
zh_hant: 清空助手的全部記憶？

source: 清空所有连接记录？
en: Clear all connection records?
zh_hant: 清空所有連線記錄？

source: 清除
en: Clear

source: 清除已保存的密码
en: Remove Saved Password
zh_hant: 清除已保存的密碼

source: 清除浏览数据（Cookie、登录状态）
en: Clear Browsing Data (Cookies, Sign-ins)
zh_hant: 清除瀏覽資料（Cookie、登入狀態）

source: 滚动到%@
en: Scroll to %@
zh_hant: 捲動到%@

source: 滚动到网页底部
en: Scroll to the bottom of the page
zh_hant: 捲動到網頁底部

source: 点 + 把一台设备添加为服务器。
en: Tap + to add a device as a server.
zh_hant: 點 + 把一台裝置新增為伺服器。

source: 点击%@
en: Click %@
zh_hant: 點擊%@

source: 焦点：%@
en: Focus: %@
zh_hant: 焦點：%@

source: 照片
en: Photos

source: 状态
en: Status
zh_hant: 狀態

source: 现在屏幕上的内容：
en: What's on screen now:
zh_hant: 現在螢幕上的內容：

source: 现在没有对话框
en: There's no dialog right now
zh_hant: 現在沒有對話框

source: 现在：%@，时区 %@，语言 %@
en: Now: %@, time zone %@, language %@
zh_hant: 現在：%@，時區 %@，語言 %@

source: 生成
en: Generate

source: 生成 %@
en: Creates %@

source: 生成一把新的 Ed25519 密钥，或者导入已有的 OpenSSH 私钥。
en: Generate a new Ed25519 key, or import an existing OpenSSH private key.
zh_hant: 生成一把新的 Ed25519 金鑰，或者導入已有的 OpenSSH 私鑰。

source: 生成二维码
en: Making a QR code
zh_hant: 產生 QR 碼

source: 生成密钥
en: Generate Key
zh_hant: 生成金鑰

source: 生成文件
en: Create File
zh_hant: 產生檔案

source: 生成新密钥
en: Generate New Key
zh_hant: 生成新金鑰

source: 生成新文字失败
en: Couldn't create the new text
zh_hant: 生成新文字失敗

source: 用 Python 生成一份 100 以内的质数表，做成 CSV 给我
en: Use Python to make a CSV of the primes under 100
zh_hant: 用 Python 產生一份 100 以內的質數表，做成 CSV 給我

source: 用 run_remote_command 配合 head / grep 看
en: use run_remote_command with head / grep

source: 用 search_files 的 text 找需要的部分，或者用 run_javascript 读进来只取需要的部分
en: Use search_files with text to find the part you need, or read it with run_javascript and keep only what you need
zh_hant: 用 search_files 的 text 找需要的部分，或者用 run_javascript 讀進來只取需要的部分

source: 用已保存的密码或密钥通过 SFTP 连接，Tailnet 里的服务器走内置 Tailscale。点文件就下载到共享文件夹的“服务器下载”里，同名文件会被替换。
en: Connects over SFTP with the saved password or key; servers on your tailnet go through the built-in Tailscale. Tap a file to download it to “Server Downloads” in the shared folder, replacing any file with the same name.
zh_hant: 用已儲存的密碼或金鑰透過 SFTP 連線，Tailnet 裡的伺服器走內建 Tailscale。點檔案就下載到共享資料夾的“伺服器下載”裡，同名檔案會被取代。

source: 用户 %@ · 系统 %@ · iowait %@
en: User %@ · System %@ · iowait %@
zh_hant: 使用者 %@ · 系統 %@ · iowait %@

source: 用户为了插话打断了这一步，它没有做完（命令已结束）。看用户的新消息决定接下来怎么做。
en: The user interrupted this step to say something; it didn't finish (the command was ended). Decide what to do next from the user's new message.
zh_hant: 使用者為了插話打斷了這一步，它沒有做完（命令已結束）。看使用者的新消息決定接下來怎麼做。

source: 用户关闭了快速联网，请用 browser_open 在浏览器里查。
en: The user turned off fast lookup; use browser_open to look it up in the browser.
zh_hant: 使用者關閉了快速聯網，請用 browser_open 在瀏覽器裡查。

source: 用户取消了
en: The user canceled
zh_hant: 使用者取消了

source: 用户取消了删除
en: The user canceled the deletion
zh_hant: 使用者取消了刪除

source: 用户名
en: Username
zh_hant: 使用者名

source: 用户拒绝了
en: The user declined
zh_hant: 使用者拒絕了

source: 用户拒绝了提交
en: The user declined to submit
zh_hant: 使用者拒絕了提交

source: 用户拒绝了这次点击
en: The user declined this click
zh_hant: 使用者拒絕了這次點擊

source: 用户拒绝执行这条命令
en: The user declined to run this command
zh_hant: 使用者拒絕執行這條命令

source: 用户拒绝运行
en: The user declined to run it
zh_hant: 使用者拒絕執行

source: 用户拒绝运行这段脚本
en: The user declined to run this script
zh_hant: 使用者拒絕執行這段指令碼

source: 用户没有回答，选择了跳过。按你的判断继续，或在回复里说明需要什么。
en: The user skipped this. Use your judgment, or say in your reply what you need.
zh_hant: 使用者沒有回答，選擇了跳過。依你的判斷繼續，或在回覆裡說明需要什麼。

source: 用电脑上的设置
en: Use the computer's setting
zh_hant: 用電腦上的設定

source: 由 Claude 自己判断：常规的改文件、跑命令直接执行，有风险的操作才拦下。
en: Claude decides: routine edits and commands run right away, and only risky actions are held back.
zh_hant: 由 Claude 自己判斷：常規的改檔案、跑命令直接執行，有風險的操作才攔下。

source: 电脑上的设置：%@
en: Computer's setting: %@
zh_hant: 電腦上的設定：%@

source: 电量：%lld%%，%@
en: Battery: %lld%%, %@
zh_hant: 電量：%lld%%，%@

source: 电量：无法读取（模拟器）
en: Battery: unavailable (Simulator)
zh_hant: 電量：無法讀取（模擬器）

source: 电量：无电池（台式机）
en: Battery: none (desktop)
zh_hant: 電量：無電池（台式機）

source: 界面语言
en: App Language
zh_hant: 介面語言

source: 留空则每次连接时询问
en: Leave empty to ask on each connection
zh_hant: 留空則每次連線時詢問

source: 略热
en: Slightly warm
zh_hant: 略熱

source: 登录 Tailscale
en: Sign In to Tailscale
zh_hant: 登入 Tailscale

source: 登录成功。
en: Signed in.
zh_hant: 登入成功。

source: 百度
en: Baidu

source: 目录 %@，权限模式“%@”：%@
en: Directory %@, permission mode “%@”: %@
zh_hant: 目錄 %@，權限模式“%@”：%@

source: 目录：%@
en: Directory: %@
zh_hant: 目錄：%@

source: 直接访问：%@
en: Direct request: %@
zh_hant: 直接存取：%@

source: 直接访问：页面几乎没有文字，可能要运行脚本才能显示
en: Direct request: the page has almost no text; it may need scripts to render
zh_hant: 直接存取：頁面幾乎沒有文字，可能要執行腳本才能顯示

source: 看看共享文件夹里收到了哪些文件，按类型整理一下
en: See what's arrived in the shared folder and sort it by type
zh_hant: 看看共享資料夾裡收到了哪些檔案，按類型整理一下

source: 看看最近的 git 改动，帮我写个提交说明
en: Look at the recent git changes and write me a commit message
zh_hant: 看看最近的 git 改動，幫我寫個提交說明

source: 石墨
en: Graphite

source: 确认 %@ 上显示的是同一组数字。
en: Make sure %@ shows the same code.
zh_hant: 確認 %@ 上顯示的是同一組數字。

source: 确认 %@ 上显示的是同一组数字，再发送。数字不一样说明连到的不是它，请取消。
en: Make sure %@ shows the same code before sending. If the codes differ, you're not connected to it. Cancel.
zh_hant: 確認 %@ 上顯示的是同一組數字，再傳送。數字不一樣說明連到的不是它，請取消。

source: 确认执行
en: Run Anyway
zh_hant: 確認執行

source: 确认网页对话框
en: Accept the page dialog
zh_hant: 確認網頁對話框

source: 磁盘
en: Disk
zh_hant: 磁碟

source: 磁盘读写
en: Disk I/O
zh_hant: 磁碟讀寫

source: 离线
en: offline
zh_hant: 離線

source: 私钥
en: Private Key
zh_hant: 私鑰

source: 私钥解密失败，请检查密钥口令。
en: Couldn't decrypt the private key. Check the passphrase.
zh_hant: 私鑰解密失敗，請檢查金鑰口令。

source: 移动
en: Move
zh_hant: 移動

# 移动 %@ → %@
source: 移动 %1$@ → %2$@
en: Move %@ → %@
zh_hant: 移動 %@ → %@

source: 移除
en: Remove

source: 移除 %@
en: Remove %@

source: 空文件夹
en: Empty folder
zh_hant: 空資料夾

source: 空白页
en: Blank page
zh_hant: 空白頁

source: 窗口
en: Window

source: 立即插入
en: Insert Now

source: 立即重新启动
en: Relaunch Now
zh_hant: 立即重新啟動

source: 竖线
en: Bar
zh_hant: 竪線

source: 端口
en: Port
zh_hant: 連接埠

source: 端口有响应，但不是 SSH 服务
en: The port answers, but it isn't an SSH server
zh_hant: 連接埠有回應，但不是 SSH 服務

# 第 %d 页的“%@”在嵌套的图形里，改不了
source: 第 %1$d 页的“%2$@”在嵌套的图形里，改不了
en: “%2$@” on page %1$d is inside nested graphics and can't be changed
zh_hant: 第 %d 頁的“%@”在嵌套的圖形裡，改不了

# 第 %d 页的“%@”是斜的或竖排的，没改
source: 第 %1$d 页的“%2$@”是斜的或竖排的，没改
en: “%2$@” on page %1$d is rotated or vertical; not changed
zh_hant: 第 %d 頁的“%@”是斜的或竪排的，沒改

# 第 %d 页的“%@”跨了行，没改
source: 第 %1$d 页的“%2$@”跨了行，没改
en: “%2$@” on page %1$d spans lines; not changed
zh_hant: 第 %d 頁的“%@”跨了行，沒改

source: 第一次互相发送时核对数字，并选择“这是我自己的设备”。之后在这些设备之间发送不用再核对，对方会自动接收。移除后需要重新核对。
en: The first time two devices send to each other, compare codes and choose “This is my own device”. After that, transfers between them need no code and are received automatically. Removing a device means comparing codes again.
zh_hant: 第一次互相傳送時核對數字，並選擇「這是我自己的裝置」。之後在這些裝置之間傳送不用再核對，對方會自動接收。移除後需要重新核對。

source: 等你回答
en: Waiting for your answer

source: 等你在助手里确认…
en: Waiting for you to confirm in the assistant…
zh_hant: 等你在助手裡確認…

source: 等你批准
en: Waiting for approval

source: 等待 %@ 接收…
en: Waiting for %@ to accept…

source: 等待定位授权…
en: Waiting for location permission…
zh_hant: 等待定位授權…

source: 等待用户输入密码
en: Waiting for the user to enter a password
zh_hant: 等待使用者輸入密碼

source: 简体中文
en: Chinese, Simplified
zh_hant: 簡體中文

source: 管理密钥…
en: Manage Keys…
zh_hant: 管理金鑰…

source: 管理浏览器标签页
en: Manage browser tabs
zh_hant: 管理瀏覽器標籤頁

source: 粘贴 OpenSSH 格式的私钥（如 ~/.ssh/id_ed25519 的内容），或者从文件导入。
en: Paste an OpenSSH private key (such as the contents of ~/.ssh/id_ed25519), or import it from a file.
zh_hant: 粘貼 OpenSSH 格式的私鑰（如 ~/.ssh/id_ed25519 的內容），或者從檔案導入。

source: 粘贴图片
en: Paste Image
zh_hant: 貼上圖片

source: 粘贴的图片
en: Pasted Image
zh_hant: 貼上的圖片

source: 粤语（中国大陆）
en: Cantonese (Chinese mainland)
zh_hant: 粵語（中國大陸）

source: 粤语（香港）
en: Cantonese (Hong Kong)
zh_hant: 粵語（香港）

source: 系统
en: System
zh_hant: 系統

source: 系统无法打开这个链接
en: The system couldn't open this link
zh_hant: 系統無法打開這個鏈接

source: 繁体中文
en: Chinese, Traditional
zh_hant: 繁體中文

source: 纬度 %.5f，经度 %.5f（精度约 %.0f 米）
en: Latitude %.5f, longitude %.5f (accurate to about %.0f m)
zh_hant: 緯度 %.5f，經度 %.5f（精度約 %.0f 米）

source: 终端
en: Terminal
zh_hant: 終端

source: 终端屏幕上的内容和命令的输出
en: What's on the terminal screen and command output
zh_hant: 終端機畫面上的內容和指令的輸出

source: 结束 %@（PID %lld）？
en: End %@ (PID %lld)?
zh_hant: 結束 %@（PID %lld）？

source: 结束进程
en: End Process
zh_hant: 結束程序

source: 绕过
en: Bypass
zh_hant: 繞過

source: 继续之前的对话
en: Continue an Earlier Conversation
zh_hant: 繼續之前的對話

source: 继续完善
en: Keep Planning
zh_hant: 繼續完善

source: 继续这个项目里之前的对话
en: Continue an earlier conversation in this project
zh_hant: 繼續這個專案里之前的對話

source: 缓存 %@
en: %@ cached
zh_hant: 快取 %@

source: 编辑
en: Edit
zh_hant: 編輯

source: 编辑 %@
en: Edit %@
zh_hant: 編輯 %@

source: 编辑…
en: Edit…
zh_hant: 編輯…

source: 编辑文档 %@
en: Edit document %@
zh_hant: 編輯文檔 %@

source: 编辑服务器
en: Edit Server
zh_hant: 編輯伺服器

source: 编辑服务器…
en: Edit Server…
zh_hant: 編輯伺服器…

source: 编辑笔记本
en: Edit Notebook
zh_hant: 編輯筆記本

source: 编辑记忆
en: Edit Memory
zh_hant: 編輯記憶

source: 网络
en: Network
zh_hant: 網路

source: 网络中断，已经 %lld 秒没有收到服务器消息，正在尝试重连…
en: Network interrupted: nothing from the server for %lld seconds. Trying to reconnect…
zh_hant: 網路中斷，已經 %lld 秒沒有收到伺服器消息，正在嘗試重連…

source: 网络：%@
en: Network: %@
zh_hant: 網路：%@

source: 网页
en: Web
zh_hant: 網頁

source: 网页前进
en: Go forward
zh_hant: 網頁前進

source: 网页后退
en: Go back
zh_hant: 網頁上一頁

# 网页弹出了对话框（%@）：“%@”。用 browser_dialog 回应，或者让用户自己点。
source: 网页弹出了对话框（%1$@）：“%2$@”。用 browser_dialog 回应，或者让用户自己点。
en: The page opened a dialog (%1$@): “%2$@”. Answer it with browser_dialog, or let the user click it.
zh_hant: 網頁彈出了對話框（%1$@）：「%2$@」。用 browser_dialog 回應，或者讓使用者自己點。

source: 网页消息
en: Message from Web Page
zh_hant: 網頁訊息

source: 翻译网页
en: Translate Page
zh_hant: 翻譯網頁

source: 能力最强，适合复杂任务
en: Most capable, for complex tasks
zh_hant: 能力最強，適合複雜任務

source: 脚本超时
en: The script timed out
zh_hant: 指令碼逾時

source: 自动
en: Auto
zh_hant: 自動

source: 自动审批
en: Auto Review
zh_hant: 自動審批

source: 自动改文件
en: Accept Edits
zh_hant: 自動改檔案

source: 自动翻译外文网页
en: Auto-Translate Foreign Pages
zh_hant: 自動翻譯外文網頁

source: 自定义提示词
en: Custom prompt
zh_hant: 自定義提示詞

source: 自己的 Key（可选）
en: Your Own Keys (Optional)
zh_hant: 自己的 Key（選填）

source: 范围
en: Scope
zh_hant: 範圍

source: 获取位置
en: Get Location
zh_hant: 獲取位置

source: 蜂窝数据
en: Cellular
zh_hant: 蜂窩資料

source: 补充或纠正，%@ 下一步就会看到…
en: Add or correct — %@ sees it at the next step…
zh_hant: 補充或更正，%@ 下一步就會看到…

source: 表单没有提交，这些字段需要先填好：
en: The form wasn't submitted; these fields need to be filled in first:
zh_hant: 表單沒有提交，這些欄位需要先填好：

source: 表格里找不到“%@”（数字请用 set_cell 改）
en: “%@” isn't in the workbook (change numbers with set_cell)
zh_hant: 表格裡找不到“%@”（數字請用 set_cell 改）

source: 被拒绝访问（%lld）
en: Access denied (%lld)
zh_hant: 被拒絕存取（%lld）

# 覆盖 %@ 上的 %@？
source: 覆盖 %1$@ 上的 %2$@？
en: Overwrite %2$@ on %1$@?
zh_hant: 覆蓋 %@ 上的 %@？

source: 解到 %@
en: Into %@

source: 解压 %@
en: Unzip %@
zh_hant: 解壓 %@

source: 解压 %@？
en: Unzip %@?
zh_hant: 解壓 %@？

source: 计划
en: Plan
zh_hant: 計劃

source: 计划已经准备好，要开始动手吗？
en: The plan is ready. Start the work?
zh_hant: 計畫已經準備好，要開始動手嗎？

source: 认证
en: Authentication
zh_hant: 認證

source: 认证方式
en: Method
zh_hant: 認證方式

source: 让 %@ 在 %@ 上工作？
en: Let %@ work on %@?
zh_hant: 讓 %@ 在 %@ 上工作？

source: 让 Claude Code 看看我项目里最近的改动
en: Have Claude Code look at the recent changes in my project
zh_hant: 讓 Claude Code 看看我專案里最近的改動

source: 让 Codex 审查还没提交的改动；可附说明，如 /review 重点看并发
en: Have Codex review uncommitted changes; add notes if you like, e.g. /review focus on concurrency
zh_hant: 讓 Codex 審查還沒提交的改動；可附說明，如 /review 重點看併發

source: 让 Conch 帮你做点什么…，/ 命令，@ 服务器
en: Ask Conch to do something… / for commands, @ for servers
zh_hant: 讓 Conch 幫你做點什麼…，/ 指令，@ 伺服器

source: 让 Conch 帮你做点什么…，输入 / 查看命令
en: Ask Conch to do something… Type / for commands
zh_hant: 讓 Conch 幫你做點什麼…，輸入 / 查看指令

source: 记住：%@
en: Remember: %@
zh_hant: 記住：%@

source: 记录连接地点
en: Record Connection Locations
zh_hant: 記錄連線地點

source: 记忆已满（%lld 条），先用 forget 删掉过时的
en: Memory is full (%lld entries). Use forget to remove outdated ones first
zh_hant: 記憶已滿（%lld 條），先用 forget 刪掉過時的

source: 记忆：%lld 条
en: Memory: %lld items
zh_hant: 記憶：%lld 條

source: 设备
en: Devices
zh_hant: 裝置

source: 设备名称
en: Device Name
zh_hant: 裝置名稱

source: 设备：
en: Devices:
zh_hant: 裝置：

source: 设备：%@（%@），%@ %@，名称“%@”
en: Device: %@ (%@), %@ %@, named “%@”
zh_hant: 設備：%@（%@），%@ %@，名稱“%@”

source: 设备：Mac（%@），macOS %@，名称“%@”
en: Device: Mac (%@), macOS %@, named “%@”
zh_hant: 設備：Mac（%@），macOS %@，名稱“%@”

source: 设定一个持续追踪的目标
en: Set a goal to keep track of
zh_hant: 設定一個持續追蹤的目標

source: 设置
en: Settings
zh_hant: 設定

source: 设置提醒：%@
en: Set reminder: %@
zh_hant: 設定提醒：%@

source: 识别语言
en: Recognition Language
zh_hant: 辨識語言

source: 诊断 %@ 的连接
en: Diagnose the connection to %@
zh_hant: 診斷 %@ 的連線

source: 询问
en: Ask
zh_hant: 詢問

source: 语言
en: Language
zh_hant: 語言

source: 语音输入
en: Dictation
zh_hant: 語音輸入

source: 语音输入：%@
en: Dictation: %@
zh_hant: 語音輸入：%@

source: 请填写 API Key 和模型。
en: Enter an API key and a model.
zh_hant: 請填寫 API Key 和模型。

source: 请更强的模型给建议
en: Ask a stronger model for advice
zh_hant: 請更強的模型給建議

source: 请求太频繁或额度用完了（429），稍后再试。
en: Too many requests, or the quota is used up (429). Try again later.
zh_hant: 請求太頻繁或額度用完了（429），稍後再試。

source: 请求太频繁（429）
en: Too many requests (429)
zh_hant: 請求太頻繁（429）

source: 请确认下面的主机密钥指纹与服务器上的一致。信任后会记住它，以后指纹变化时会提醒你。
en: Check that the host key fingerprint below matches the server's. Once trusted, it's remembered and you'll be warned if it ever changes.
zh_hant: 請確認下面的主機金鑰指紋與伺服器上的一致。信任後會記住它，以後指紋變化時會提醒你。

source: 请设置文件密码
en: Set a file password
zh_hant: 請設定檔案密碼

source: 请说话…
en: Speak…
zh_hant: 請說話…

source: 读 %@ 写 %@
en: Read %@ Write %@
zh_hant: 讀 %@ 寫 %@

source: 读不了“%@”。
en: Can’t read “%@”.
zh_hant: 讀不了「%@」。

source: 读不到服务器状态
en: Can’t Read Server Status
zh_hant: 讀不到伺服器狀態

source: 读取
en: Read
zh_hant: 讀取

# 读取 %@%@
source: 读取 %1$@%2$@
en: Read %@%@
zh_hant: 讀取 %@%@

source: 读取了 %lld 个文件
en: read %lld files
zh_hant: 讀取了 %lld 個檔案

source: 读取剪贴板
en: Read Clipboard
zh_hant: 讀取剪貼簿

source: 读取历史记录失败：%@
en: Couldn't load history: %@
zh_hant: 讀取歷史記錄失敗：%@

source: 读取提示词失败：%@
en: Couldn't read the prompt: %@
zh_hant: 讀取提示詞失敗：%@

source: 读取文档 %@
en: Read document %@
zh_hant: 讀取文檔 %@

source: 读取终端内容
en: Read Terminal
zh_hant: 讀取終端內容

source: 读取网页：%@
en: Read page: %@
zh_hant: 讀取網頁：%@

source: 调整外观
en: Change Appearance
zh_hant: 調整外觀

source: 调节亮度
en: Adjust Brightness
zh_hant: 調節亮度

source: 负载
en: Load
zh_hant: 負載

source: 账号
en: Account
zh_hant: 帳號

source: 账号：%@
en: Account: %@
zh_hant: 帳號：%@

source: 跑一下测试，修掉失败的用例
en: Run the tests and fix the failing ones
zh_hant: 跑一下測試，修掉失敗的用例

source: 跟随界面
en: Same as App
zh_hant: 跟隨介面

source: 跟随界面语言
en: Same as App Language
zh_hant: 跟隨介面語言

source: 跟随界面语言（%@）
en: Same as App Language (%@)
zh_hant: 跟隨介面語言（%@）

source: 跟随系统
en: System Default
zh_hant: 跟隨系統

source: 跟随系统=%@
en: follow system=%@
zh_hant: 跟隨系統=%@

source: 跟随系统深浅色
en: Match System Appearance
zh_hant: 跟隨系統深淺色

source: 身份验证失败，请检查用户名、密码或密钥。
en: Authentication failed. Check the username, password or key.
zh_hant: 身份驗證失敗，請檢查使用者名、密碼或金鑰。

source: 载入问题：%@
en: Loading problem: %@
zh_hant: 載入問題：%@

source: 较热，系统可能降频
en: Hot; the system may throttle
zh_hant: 較熱，系統可能降頻

source: 输入 %@
en: %@ in
zh_hant: 輸入 %@

source: 输入你的回答
en: Type your answer
zh_hant: 輸入你的回答

source: 输入后会按回车执行
en: Presses Return after typing
zh_hant: 輸入後會按回車執行

source: 输入密码
en: Enter Password
zh_hant: 輸入密碼

source: 输入：%@
en: Input: %@
zh_hant: 輸入：%@

source: 输出 %@
en: %@ out
zh_hant: 輸出 %@

source: 输出： %@
en: Output: %@
zh_hant: 輸出： %@

source: 过热
en: Overheating
zh_hant: 過熱

source: 运行 JavaScript
en: Running JavaScript
zh_hant: 執行 JavaScript

source: 运行 JavaScript：%@
en: Running JavaScript: %@
zh_hant: 執行 JavaScript：%@

source: 运行 JavaScript？
en: Run JavaScript?
zh_hant: 執行 JavaScript？

source: 运行中
en: Running
zh_hant: 執行中

source: 运行了 %lld 个子任务
en: ran %lld subtasks
zh_hant: 執行了 %lld 個子任務

source: 运行了 %lld 条命令
en: ran %lld commands
zh_hant: 執行了 %lld 條命令

source: 运行命令
en: Run Command
zh_hant: 執行命令

source: 运行完成（没有返回值，也没有输出）
en: Done (no return value, no output)
zh_hant: 執行完成（沒有傳回值，也沒有輸出）

source: 运行快捷指令“%@”？
en: Run the shortcut “%@”?
zh_hant: 執行捷徑“%@”？

source: 运行快捷指令：%@
en: Run shortcut: %@
zh_hant: 執行捷徑：%@

source: 运行超过 %lld 秒，已停止（可能是死循环或数据太大）
en: Stopped after %lld seconds (an endless loop, or too much data?)
zh_hant: 執行超過 %lld 秒，已停止（可能是無窮迴圈或資料太大）

source: 运行项目看改动效果
en: Run the project to see the change working
zh_hant: 執行專案看改動效果

source: 返回值： %@
en: Return value: %@
zh_hant: 傳回值： %@

source: 还没有
en: None yet
zh_hant: 還沒有

source: 还没有信任这台服务器的主机密钥：先在终端里连一次，信任后再来。
en: This server's host key isn't trusted yet. Connect to it once in the terminal, trust the key, then come back.
zh_hant: 還沒有信任這台伺服器的主機金鑰：先在終端機裡連一次，信任後再來。

source: 还没有密钥
en: No Keys Yet
zh_hant: 還沒有金鑰

source: 还没有对话内容可以压缩。
en: There's nothing in this conversation to compact yet.
zh_hant: 還沒有對話內容可以壓縮。

source: 还没有服务器
en: No Servers Yet
zh_hant: 還沒有伺服器

source: 还没有服务器。先把你的电脑添加为一台服务器。
en: No servers yet. Add your computer as a server first.
zh_hant: 還沒有伺服器。先把你的電腦添加為一台伺服器。

source: 还没有服务器，点击 + 添加
en: No servers yet. Tap + to add one
zh_hant: 還沒有伺服器，點擊 + 新增

source: 还没有记录
en: No Records Yet
zh_hant: 還沒有記錄

source: 还没有配置 AI 服务。请先填写 API Key。
en: No AI service is set up yet. Enter an API key first.
zh_hant: 還沒有配置 AI 服務。請先填寫 API Key。

source: 这一步做完就交给助手
en: Goes to the assistant when this step is done
zh_hant: 這一步做完就交給助手

source: 这一轮失败了
en: This turn failed
zh_hant: 這一輪失敗了

source: 这一轮已经结束，但结果没有收全。重新打开这个对话可以看到完整记录。
en: This turn has ended, but not all of its output arrived. Reopen this conversation to see the full record.
zh_hant: 這一輪已經結束，但結果沒有收全。重新打開這個對話可以看到完整記錄。

source: 这一轮没能开始
en: This turn couldn't start
zh_hant: 這一輪沒能開始

source: 这一轮结束后发送…
en: Sends when this turn ends…
zh_hant: 這一輪結束後發送…

source: 这不是 Conch 导出的文件。
en: This isn't a file exported from Conch.
zh_hant: 這不是 Conch 匯出的檔案。

source: 这不是 Excel 工作簿（找不到工作表）
en: This isn't an Excel workbook (no sheets found)
zh_hant: 這不是 Excel 工作簿（找不到工作表）

source: 这不是 Word 文档（缺少 word/document.xml）
en: This isn't a Word document (word/document.xml is missing)
zh_hant: 這不是 Word 文檔（缺少 word/document.xml）

source: 这个 PDF 有密码，请用户先解除
en: This PDF has a password; ask the user to remove it first
zh_hant: 這個 PDF 有密碼，請使用者先解除

source: 这个 PDF 的字体没法直接改写（多见于浏览器打印的 PDF），这次是用背景色盖住旧字、在上面写新字：看起来已经改好，但旧字还留在底层，复制或搜索时可能还找得到。
en: This PDF's fonts can't be rewritten directly (common in PDFs printed from a browser), so the old text was covered with the background color and the new text written on top. It looks right, but the old text is still underneath and may turn up when copying or searching.
zh_hant: 這個 PDF 的字體沒法直接改寫（多見於瀏覽器打印的 PDF），這次是用背景色蓋住舊字、在上面寫新字：看起來已經改好，但舊字還留在底層，複製或搜索時可能還找得到。

source: 这个 Tailnet 里还没有其他设备
en: No other devices in this tailnet yet
zh_hant: 這個 Tailnet 裡還沒有其他裝置

source: 这个文件设置了密码。
en: This file is password-protected.
zh_hant: 這個檔案設定了密碼。

source: 这个服务没有提供模型列表，可以在下面直接填模型名。
en: This service doesn't list its models. Enter a model name below.
zh_hant: 這個服務沒有提供模型列表，可以在下面直接填模型名。

source: 这个演示文稿里没有幻灯片
en: This presentation has no slides
zh_hant: 這個簡報裡沒有投影片

source: 这个目录下没有对话记录。
en: No conversations in this directory.
zh_hant: 這個目錄下沒有對話記錄。

source: 这个目录不是 git 仓库。
en: This directory isn't a git repository.
zh_hant: 這個目錄不是 git 倉庫。

source: 这个项目是做什么的？给我一个概览
en: What does this project do? Give me an overview
zh_hant: 這個專案是做什麼的？給我一個概覽

source: 这个项目里没有其他对话，可以切到“全部项目”看看。
en: No other conversations in this project. Try “All Projects”.
zh_hant: 這個專案里沒有其他對話，可以切到“全部專案”看看。

source: 这台服务器没有打开的会话
en: This server has no open sessions
zh_hant: 這台伺服器沒有打開的會話

source: 这台机器上找不到 %@ 命令。请先安装：%@
en: The %@ command wasn't found on this machine. Install it first: %@
zh_hant: 這台機器上找不到 %@ 命令。請先安裝：%@

source: 这台电脑上没有找到 %@ 命令。在电脑终端里安装：
en: The %@ command wasn't found on this computer. Install it in a terminal on the computer:
zh_hant: 這台電腦上沒有找到 %@ 命令。在電腦終端里安裝：

source: 这台电脑上还没有 %@ 的其他对话。
en: No other %@ conversations on this computer yet.
zh_hant: 這台電腦上還沒有 %@ 的其他對話。

source: 这台电脑上还没有 %@ 的对话记录。
en: No %@ conversations on this computer yet.
zh_hant: 這台電腦上還沒有 %@ 的對話記錄。

source: 这台设备会从 Tailnet 中移除，以后要重新登录。
en: This device will be removed from the tailnet and will need to sign in again.
zh_hant: 這台裝置會從 Tailnet 中移除，以後要重新登入。

source: 这是一个文件下载（%@），内置浏览器不能下载文件。
en: This link is a file download (%@); the built-in browser can't download files.
zh_hant: 這是一個檔案下載（%@），內建瀏覽器不能下載檔案。

source: 这是我自己的设备（以后不用再核对）
en: This is my own device (skip codes next time)
zh_hant: 這是我自己的裝置（以後不用再核對）

source: 这是我自己的设备（以后自动接收）
en: This is my own device (accept automatically next time)
zh_hant: 這是我自己的裝置（以後自動接收）

source: 这种连接方式不支持此操作。
en: This connection type doesn’t support that.
zh_hant: 這種連線方式不支援此操作。

source: 进程
en: Processes
zh_hant: 程序

source: 远程 Claude Code / Codex
en: Remote Claude Code / Codex
zh_hant: 遠端 Claude Code / Codex

source: 远程 Claude Code / Codex（⌘⇧A）
en: Remote Claude Code / Codex (⌘⇧A)
zh_hant: 遠端 Claude Code / Codex（⌘⇧A）

source: 连不上
en: Unreachable
zh_hant: 連不上
